/*1*/

var a = (prompt('Коти мявкають?'));
var b = 0;
var c  = 0;
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
++b;}
else {alert('Неправильно');}

/*2*/

var a = (prompt('Собаки гавкають?'));
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*3*/

var a = (prompt('Чебуреки літають?'));
if (a === "ні") {
b++;
alert('Правильно');}
else if (a === "так")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*4*/

var a = (prompt('Пташки співають?'));
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*5*/

var a = (prompt('Путін х###о?'));
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*6*/

var a = (prompt('Кіркоров вміє співати?'));
if (a === "ні") {
b++;
alert('Правильно');}
else if (a === "так")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*7*/

var a = (prompt('Земля квадратна?'));
if (a === "ні") {
b++;
alert('Правильно');}
else if (a === "так")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*8*/

var a = (prompt('Борщ смачний?'));
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*9*/

var a = (prompt('Вампіри існують?'));
if (a === "ні") {
b++;
alert('Правильно');}
else if (a === "так")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*10*/

var a = (prompt('В людей дві ноги?'));
if (a === "так") {
b++;
alert('Правильно');}
else if (a === "ні")
{alert('Неправильно');
c++;}
else {alert('Неправильно');}

/*result*/

/*true*/
alert('вірних='+ b + ' невірних=' + c);
if (b >= 5) {
alert('Добре! Твій результат на відповіді очевидних питань середній!');}
else if (b >= 8)
{alert('Не погано! Твій результат на відповіді очевидних питань високий!');}
else if (b >= 10)
{alert('Молодець! Твій результат на відповіді очевидних питань ідеальний!');}

/*wrong*/
alert('вірних='+ b + ' невірних=' + c);
if (c <= 5) {
alert('Не дуже! Твій результат на відповіді очевидних питань середній!');}
else if (c <= 8)
{alert('Погано! Твій результат на відповіді очевидних питань занадто малий!');}
else if (c <= 10)
{alert('Стидоба! Ти не відповів ніразу правильно!');}
